# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1  # model depth multiple
width_multiple: 1  # layer channel multiple

anchors:
  - [14,13, 101,52, 34,41]  # P3/8
  - [88,79, 68,95, 188,103]  # P4/16
  - [142,131, 138,206, 276,192]  # P5/32



# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, PatchEmbed_FasterNet, [40, 4, 4]],  # 0-P1/4                    0
   [-1, 1, BasicStage, [40, 1]],  # 1                                      1
   [-1, 1, PatchMerging_FasterNet, [80, 2, 2]],  # 2-P2/8                  2
   [-1, 1, BiFormerBlock, [80, 4]],  # update                              3
   [-1, 1, BasicStage, [80, 1]],  # 3-P3/16                                4
   [-1, 1, PatchMerging_FasterNet, [160, 2, 2]],  # 4                      5
   [-1, 1, C3_DCN, [160]],                                             #   6
   [-1, 1, BasicStage, [160, 1]],  # 5-P4/32                               7
   [-1, 1, PatchMerging_FasterNet, [320, 2, 2]], # 6                       8
   [-1, 1, BasicStage, [320, 1]], # 7                                      9

  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [64, 1, 1]],                                          #  10
   [-1, 1, CARAFE, [3, 5]],                                            #  11
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4                          12
   [-1, 1, Conv, [64, 1, 1]],  # 12                                       13

   [-1, 1, Conv, [32, 1, 1]],                                          #  14
   [-1, 1, CARAFE, [3, 5]],                     # 15                      15
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3                          16
   [-1, 1, Conv, [32, 1, 1]],  # 16 (P3/8-small)                          17

   [-1, 1, Conv, [32, 3, 2]],                                          #  18
   [[-1, 14], 1, Concat, [1]],  # cat head P4                             19
   [-1, 1, Conv, [64, 1, 1]],  # 19 (P4/16-medium)                        20

   [-1, 1, Conv, [64, 3, 2]],                                          #  21
   [[-1, 10], 1, Concat, [1]],  # cat head P5                             22
   [-1, 1, Conv, [128, 1, 1]],  # 22 (P5/32-large)                        23

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
